3.28_Superficial_gas_velocity/Case_files/Syamlal_OBrien/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          23;
        startFace       5467;
    }
    outlet
    {
        type            patch;
        nFaces          23;
        startFace       5490;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          244;
        startFace       5513;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          5612;
        startFace       5757;
    }
)

// ************************************************************************* //
